In [1]:
import pandas as pd

In [2]:
people = {
    "이름" : ["오공","지터","오반"],
    "성"   : ["손", "베", "손"],
    "이메일" : ["gks@gmail.com","jtv@gmail.com","ghs@gmail.com",]
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   이름  성            이메일
0  오공  손  gks@gmail.com
1  지터  베  jtv@gmail.com
2  오반  손  ghs@gmail.com

In [5]:
df.columns

Index(['이름', '성', '이메일'], dtype='object')

In [6]:
df.columns = ['first_name', 'last_name', 'email']

In [7]:
df

  first_name last_name          email
0         오공         손  gks@gmail.com
1         지터         베  jtv@gmail.com
2         오반         손  ghs@gmail.com

In [8]:
[x for x in df.columns]

['first_name', 'last_name', 'email']

In [9]:
col_arr = [x for x in df.columns]

In [10]:
col_arr

['first_name', 'last_name', 'email']

In [11]:
arr =[x for x in range(1,10,2) ]
arr

[1, 3, 5, 7, 9]

In [12]:
col_arr = [x.upper() for x in df.columns]
col_arr

['FIRST_NAME', 'LAST_NAME', 'EMAIL']

In [13]:
df.columns = col_arr
df

  FIRST_NAME LAST_NAME          EMAIL
0         오공         손  gks@gmail.com
1         지터         베  jtv@gmail.com
2         오반         손  ghs@gmail.com

In [14]:
df.columns = [x.replace('_', ' ') for x in df.columns]

In [15]:
df

  FIRST NAME LAST NAME          EMAIL
0         오공         손  gks@gmail.com
1         지터         베  jtv@gmail.com
2         오반         손  ghs@gmail.com

In [16]:
arr = ['my_apple','your_grape','his_money']

In [17]:
type(df.columns)

pandas.core.indexes.base.Index

In [19]:
df.columns.str

In [20]:
df

  FIRST NAME LAST NAME          EMAIL
0         오공         손  gks@gmail.com
1         지터         베  jtv@gmail.com
2         오반         손  ghs@gmail.com

In [21]:
df.columns = [x.replace(' ', '_') for x in df.columns]

In [22]:
df

  FIRST_NAME LAST_NAME          EMAIL
0         오공         손  gks@gmail.com
1         지터         베  jtv@gmail.com
2         오반         손  ghs@gmail.com

In [26]:
df.rename(columns= {"FIRST_NAME" : "first", "LAST_NAME" : "last"})

  first last          EMAIL
0    오공    손  gks@gmail.com
1    지터    베  jtv@gmail.com
2    오반    손  ghs@gmail.com

In [27]:
df

  FIRST_NAME LAST_NAME          EMAIL
0         오공         손  gks@gmail.com
1         지터         베  jtv@gmail.com
2         오반         손  ghs@gmail.com

In [28]:
df.rename(columns = {"FIRST_NAME" : "first", "LAST_NAME" : "last"})

  first last          EMAIL
0    오공    손  gks@gmail.com
1    지터    베  jtv@gmail.com
2    오반    손  ghs@gmail.com

In [29]:
df

  FIRST_NAME LAST_NAME          EMAIL
0         오공         손  gks@gmail.com
1         지터         베  jtv@gmail.com
2         오반         손  ghs@gmail.com

In [30]:
df.rename(columns = {"FIRST_NAME" : "first", "LAST_NAME" : "last"}, inplace=True)

In [31]:
df

  first last          EMAIL
0    오공    손  gks@gmail.com
1    지터    베  jtv@gmail.com
2    오반    손  ghs@gmail.com

In [33]:
df.loc[2]

first               오반
last                 손
EMAIL    ghs@gmail.com
Name: 2, dtype: object

In [34]:
df.loc[2,'first']

'오반'

In [35]:
df.loc[2] = ['몽룡','이','mrlee@yju.ac.kr']

In [36]:
df

  first last            EMAIL
0    오공    손    gks@gmail.com
1    지터    베    jtv@gmail.com
2    몽룡    이  mrlee@yju.ac.kr

In [37]:
df.loc[2,['last','EMAIL']]

last                   이
EMAIL    mrlee@yju.ac.kr
Name: 2, dtype: object

In [38]:
df.loc[2,['last','EMAIL']] = ['Lee' , 'mrlee@gmail.com']

In [40]:
df.rename(columns = {'EMAIL': 'email'}, inplace=True)

In [41]:
df

  first last            email
0    오공    손    gks@gmail.com
1    지터    베    jtv@gmail.com
2    몽룡  Lee  mrlee@gmail.com

In [42]:
df['email'] == 'mrlee@gmail.com'

0    False
1    False
2     True
Name: email, dtype: bool

In [43]:
df[df['email'] == 'mrlee@gmail.com']

  first last            email
2    몽룡  Lee  mrlee@gmail.com